







nc: 80
scales:

  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]


backbone:

  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  - [-1, 3, C3Ghost, [128, True]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 6, C3Ghost, [256, True]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [-1, 6, C3Ghost, [512, True]]
  - [-1, 1, GhostConv, [768, 3, 2]]
  - [-1, 3, C3Ghost, [768, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 3, C3Ghost, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]


head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [768]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [256]]

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [512]]

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [768]]

  - [-1, 1, GhostConv, [768, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C3Ghost, [1024]]

  - [[20, 23, 26, 29], 1, Detect, [nc]]
