






nc: 1000
scales:

  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]


backbone:

  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 6]]
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]


head:
  - [-1, 1, Classify, [nc]]
