






nc: 80
scales:

  x: [1.00, 1.00, 2048]

backbone:

  - [-1, 1, HGStem, [32, 64]]
  - [-1, 6, HGBlock, [64, 128, 3]]

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [128, 512, 3]]
  - [-1, 6, HGBlock, [128, 512, 3, False, True]]

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, False]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [256, 1024, 5, True, True]]

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [512, 2048, 5, True, False]]
  - [-1, 6, HGBlock, [512, 2048, 5, True, True]]

head:
  - [-1, 1, Conv, [384, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [2048, 8]]
  - [-1, 1, Conv, [384, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [10, 1, Conv, [384, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [384]]
  - [-1, 1, Conv, [384, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [384, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [384]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 21], 1, Concat, [1]]
  - [-1, 3, RepC3, [384]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [384]]

  - [[25, 28, 31], 1, RTDETRDecoder, [nc]]
