






nc: 80
scales:

  l: [1.00, 1.00, 1024]

backbone:

  - [-1, 1, ResNetLayer, [3, 64, 1, True, 1]]
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 3]]
  - [-1, 1, ResNetLayer, [256, 128, 2, False, 4]]
  - [-1, 1, ResNetLayer, [512, 256, 2, False, 23]]
  - [-1, 1, ResNetLayer, [1024, 512, 2, False, 3]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  - [[16, 19, 22], 1, RTDETRDecoder, [nc]]
